phoenix-rtos/phoenix-rtos-lwip/drivers/imxrt-enet.c
/*
 * Phoenix-RTOS --- networking stack
 *
 * imxrt1064 ENET network module driver
 *
 * Copyright 2023 Phoenix Systems
 * Author: Phoenix Systems
 *
 * %LICENSE%
 */
#include "arch/cc.h"
#include "lwip/etharp.h"
#include "netif-driver.h"
#include "bdring.h"
#include "ephy.h"
#include "hw-debug.h"
#include "physmmap.h"
#include "res-create.h"
#include "imxrt-enet-regs.h"

#include <sys/interrupt.h>
#include <sys/platform.h>
#include <sys/threads.h>
#include <phoenix/arch/imxrt.h>
#include <stdatomic.h>
#include <endian.h>
#include <errno.h>
#include <stdarg.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>

#define ENET_VERBOSE

#define ENET_CLK_KHZ			(132000 /* IPG */)	// BT_FREQ=0

#define USE_ENET_EXT_DESCRIPTORS	0
#define USE_RMII			1
#define ENABLE_FLOW_CONTROL		1
#define ENABLE_PROMISC			0
#define ENABLE_RX_PAD_REMOVE		1
#define ENET_RX_RING_SIZE		64
#define ENET_TX_RING_SIZE		64
#define ENET_BUFFER_SIZE		(2048 - 64)
#define MDC_ALWAYS_ON			1
#define MDIO_DEBUG			1


#if USE_ENET_EXT_DESCRIPTORS
typedef enet_long_desc_t enet_buf_desc_t;
#else
typedef enet_short_desc_t enet_buf_desc_t;
#endif

typedef struct
{
	volatile struct enet_regs *mmio;

	struct netif *netif;
	unsigned drv_exit;

#define PRIV_RESOURCES(s) &(s)->irq_lock, 3, ~0x03
	handle_t irq_lock, tx_lock, irq_cond, irq_handle;

	net_bufdesc_ring_t rx, tx;

	addr_t devphys;
	uint32_t mscr;

	char name[32];

	eth_phy_state_t phy;

	uint32_t irq_stack[1024] __attribute__((aligned(16))), mdio_stack[1024];
} enet_priv_t;


enum {
	VDBG = 0,
	DEBUG = 1,
	NOTICE = 2,

	EV_BUS_ERROR = 0x01,
};


#if 1
static void enet_printf(enet_priv_t *state, const char *format, ...)
{
	char buf[192];
	va_list arg;

	va_start(arg, format);
	vsnprintf(buf, sizeof(buf), format, arg);
	va_end(arg);
	printf("lwip: %s %s\n", state->name, buf);
}
#else
#define enet_printf(...)
#endif


static void enet_reset(enet_priv_t *state)
{
	// FIXME: timeout

	/* trigger and wait for reset */
	enet_printf(state, "Resetting device...");
	state->mmio->ECR = ENET_ECR_REG_MAGIC | ENET_ECR_RESET;
	do usleep(100); while (state->mmio->ECR & ENET_ECR_ETHEREN);
	enet_printf(state, "Reset done.");

	state->mmio->IAUR = 0;
	state->mmio->IALR = 0;
	state->mmio->GAUR = 0;
	state->mmio->GALR = 0;
}


static void enet_start(enet_priv_t *state)
{
//	addr_t ecr_pa = (addr_t)&((struct enet_regs *)state->phys)->ECR;
	// FIXME: last_will(ECR = ENET_ECR_REG_MAGIC | ENET_ECR_RESET);

	state->mmio->MRBR = ENET_BUFFER_SIZE;	// FIXME: coerce with net_allocPktBuf()
	state->mmio->FTRL = BIT(14)-1;	// FIXME: truncation to just above link MTU

	state->mmio->RCR = (1518 << 16) |
			  ENET_RCR_CRCFWD | ENET_RCR_PAUFWD |
#if ENABLE_RX_PAD_REMOVE
			  ENET_RCR_PADEN |
#endif
#if USE_RMII
			  ENET_RCR_RMII_MODE |
#endif
#if ENABLE_FLOW_CONTROL
			  ENET_RCR_FCE |
#endif
#if ENABLE_PROMISC
			  ENET_RCR_PROM |
#endif
			  ENET_RCR_MII_MODE;
	state->mmio->RACC = ENET_RACC_SHIFT16 |
#if !ENABLE_PROMISC
			   ENET_RACC_LINEDIS | ENET_RACC_PRODIS | ENET_RACC_IPDIS |
#endif
			   ENET_RACC_PADREM;

	state->mmio->TCR = ENET_TCR_FDEN;
#if ETH_PAD_SIZE == 2
	state->mmio->TACC = ENET_TACC_SHIFT16;
#else
	state->mmio->TACC = 0;
#endif

	mutexLock(state->irq_lock);
	state->mmio->EIMR |= ENET_IRQ_EBERR;
	mutexUnlock(state->irq_lock);

	state->mmio->ECR = ENET_ECR_REG_MAGIC |
#if USE_ENET_EXT_DESCRIPTORS
			  ENET_ECR_EN1588 |
#endif
#if __BYTE_ORDER == __LITTLE_ENDIAN
			  ENET_ECR_DBSWP |
#endif
			  ENET_ECR_ETHEREN;

	/* trigger HW RX */
	state->mmio->RDAR = ~0u;

#ifdef ENET_VERBOSE
	enet_printf(state, "regs:   ECR   ,  EIMR  ,  TACC  ,  RACC  ,  TCR   ,  RCR   ,  MRBR  ,  FTRL  ");
	enet_printf(state, "regs: %08x %08x %08x %08x %08x %08x %08x %08x",
		state->mmio->ECR, state->mmio->EIMR, state->mmio->TACC, state->mmio->RACC,
		state->mmio->TCR, state->mmio->RCR, state->mmio->MRBR, state->mmio->FTRL);
	enet_printf(state, "regs:   PLL6  ,  CCGR0 ,  GPR1  ,TXCLKMUX,OSC24-M0,OSC24-LP"); //enet_printf(state, "regs:   PLL6  ,  CCGR0 ,  GPR1  ,TXCLKMUX,TXCLKPAD,RCLK1SID,OSC24-M0,OSC24-LP");
	enet_printf(state, "regs: %08x %08x %08x %08x %08x %08x",
		hwdebug_read(0x400d80e0), hwdebug_read(0x400fc068), hwdebug_read(0x400ac004), hwdebug_read(0x401f8448),
		hwdebug_read(0x400d8150), hwdebug_read(0x400fc054)); //hwdebug_read(0x20e0368), hwdebug_read(0x20e0574), hwdebug_read(0x400d8150), hwdebug_read(0x400fc054));
#endif
}


static int enet_readFusedMac(uint32_t *buf)
{
	volatile uint32_t *va = physmmap(0x401f4000, 0x1000);

	if (va == MAP_FAILED)
		return -ENOMEM;

	buf[0] = va[0x100 + 4 * 0x22];
	buf[1] = va[0x100 + 4 * 0x23];
	buf[2] = va[0x100 + 4 * 0x24];

	physunmap(va, 0x1000);

	return 0;
}

static uint32_t enet_readCpuId(void)
{
	volatile uint32_t *va = physmmap(0x401f4000, 0x1000);
	uint32_t res = 0;

	if (va == MAP_FAILED)
		return 0;

	/* use CFG1: wafer no + x/y coordinate */
	res = va[0x100 + 4 * 0x02];

	physunmap(va, 0x1000);

	return res;
}


static inline uint8_t get_byte(uint32_t v, int i)
{
	return (v >> (i * 8)) & 0xFF;
}


static void enet_readCardMac(enet_priv_t *state)
{
	static const struct eth_addr zero_eth = { { 0, 0, 0, 0, 0, 0 } };

	uint32_t buf[3];
	uint8_t *mac;

	mac = (void *)&state->netif->hwaddr;

	if (state->devphys == 0x402D8000 /* imxrt1064.ENET1 */ && !enet_readFusedMac(buf)) {
		mac[0] = get_byte(buf[1], 1);
		mac[1] = get_byte(buf[1], 0);
		mac[2] = get_byte(buf[0], 3);
		mac[3] = get_byte(buf[0], 2);
		mac[4] = get_byte(buf[0], 1);
		mac[5] = get_byte(buf[0], 0);
	} else if (state->devphys == 0x402D4000 /* imxrt1064.ENET2 */ && !enet_readFusedMac(buf)) {
		mac[0] = get_byte(buf[2], 3);
		mac[1] = get_byte(buf[2], 2);
		mac[2] = get_byte(buf[2], 1);
		mac[3] = get_byte(buf[2], 0);
		mac[4] = get_byte(buf[1], 3);
		mac[5] = get_byte(buf[1], 2);
	} else {
		buf[0] = state->mmio->PALR;
		buf[1] = state->mmio->PAUR;

		mac[0] = get_byte(buf[0], 3);
		mac[1] = get_byte(buf[0], 2);
		mac[2] = get_byte(buf[0], 1);
		mac[3] = get_byte(buf[0], 0);
		mac[4] = get_byte(buf[1], 3);
		mac[5] = get_byte(buf[1], 2);
	}

	if (memcmp(mac, &zero_eth.addr, ETH_HWADDR_LEN) == 0) {
		uint32_t cpuId = enet_readCpuId();
		mac[0] = 0x02;
		mac[1] = (cpuId >> 24) & 0xFF;
		mac[2] = (cpuId >> 16) & 0xFF;
		mac[3] = (cpuId >>  8) & 0xFF;
		mac[4] = (cpuId >>  0) & 0xFF;
		mac[5] = state->devphys >> 16;
	}

	state->mmio->PALR = be32toh(*(uint32_t *)mac);
	state->mmio->PAUR = (be16toh(*(uint16_t *)(mac + 4)) << 16) | 0x8808;
}


static void enet_showCardId(enet_priv_t *state)
{
	uint8_t *mac = (void *)&state->netif->hwaddr;
	printf("lwip: %s initialized, MAC=%02x:%02x:%02x:%02x:%02x:%02x\n", state->name, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
}


static size_t enet_nextRxBufferSize(const net_bufdesc_ring_t *ring, size_t i)
{
	volatile enet_buf_desc_t *desc = (volatile enet_buf_desc_t *)ring->ring + i;
	size_t sz;

