phoenix-rtos/phoenix-rtos-lwip/drivers/imxrt-enet.c
static void enet_mdioWrite(void *arg, unsigned addr, uint16_t reg, uint16_t val)
{
	enet_priv_t *state = arg;

	enet_mdioIO(state, addr, reg, val, 0);
#if MDIO_DEBUG
	// enet_printf(state, "MDIO %02x[%02x] := %04x", addr, reg, val);
#endif
}


static const mdio_bus_ops_t enet_mdio_ops = {
	enet_mdioSetup,
	enet_mdioRead,
	enet_mdioWrite,
};


static int platformctl_seq(const platformctl_t *pctl, size_t n)
{
	int err = 0;

	for (; n--; ++pctl) {
		err = platformctl((platformctl_t *)pctl);
		if (err < 0)
			break;
	}

	return err;
}


static int enet_initMDIO(enet_priv_t *state)
{
#ifdef ENET_VERBOSE
	enet_printf(state, "configuring MDIO pins");
#endif

	static const platformctl_t pctl_enet1[] = {
		{ pctl_set, pctl_ioisel, .ioisel = { pctl_isel_enet_mdio, 1 } },

		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_emc_40, 1, 0, 1, 1, 0, 2, 6, 0 } },
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_emc_41, 1, 0, 1, 1, 0, 2, 6, 0 } },

		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_emc_40, 1, 4 } }, //enet_mdc
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_emc_41, 1, 4 } }, //enet_mdio
	};
	static const platformctl_t pctl_enet2[] = {
		{ pctl_set, pctl_ioisel, .ioisel = { pctl_isel_enet2_ipp_ind_mac0_mdio, 1 } },
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b0_01, 0, 8 } },
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b0_00, 0, 8 } },
	};

	int err;

	if (state->devphys == 0x402D8000 /* imxrt1064.ENET1 */)
		err = platformctl_seq(pctl_enet1, sizeof(pctl_enet1) / sizeof(*pctl_enet1));
	else if (state->devphys == 0x402D4000 /* imxrt1064.ENET2 */)
		err = platformctl_seq(pctl_enet2, sizeof(pctl_enet2) / sizeof(*pctl_enet2));
	else
		err = 0;

	if (err < 0) {
		enet_printf(state, "Can't configure MDIO pins");
		return err;
	}

	state->mscr = (1 << ENET_MSCR_SPEED_SHIFT) | ENET_MSCR_DIS_PRE;

	return 0;
}


static int enet_clockEnable(enet_priv_t *state)
{
	static const platformctl_t pctl_enet_clock = {
		pctl_set, pctl_devclock, .devclock = { pctl_clk_enet, 3 }
	};
	int err;

	err = platformctl_seq(&pctl_enet_clock, 1);
	if (err < 0)
		enet_printf(state, "Can't enable ENET clock\n");

	return err;
}


static int enet_pinConfig(enet_priv_t *state)
{
	static const platformctl_t pctl_enet1[] = {
		{ pctl_set, pctl_iogpr, .iogpr = { pctl_gpr_enet1_clk_sel, 0} },
		{ pctl_set, pctl_iogpr, .iogpr = { pctl_gpr_enet1_tx_clk_dir, 1 } },

		{ pctl_set, pctl_ioisel, .ioisel = { pctl_isel_enet_txclk, 1 } },
		{ pctl_set, pctl_ioisel, .ioisel = { pctl_isel_enet0_timer, 2 } },
		{ pctl_set, pctl_ioisel, .ioisel = { pctl_isel_enet_rxerr, 1 } },
		{ pctl_set, pctl_ioisel, .ioisel = { pctl_isel_enet_rxen, 1 } },
		{ pctl_set, pctl_ioisel, .ioisel = { pctl_isel_enet1_rxdata, 1 } },
		{ pctl_set, pctl_ioisel, .ioisel = { pctl_isel_enet0_rxdata, 1 } },
		{ pctl_set, pctl_ioisel, .ioisel = { pctl_isel_enet_mdio, 1 } },
		{ pctl_set, pctl_ioisel, .ioisel = { pctl_isel_enet_ipg_clk_rmi, 1 } },

		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_04, 1, 2, 1, 1, 0, 2, 6, 0 } }, //enet1_rx0
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_05, 1, 2, 1, 1, 0, 2, 6, 0 } }, //enet1_rx1
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_06, 1, 2, 1, 1, 0, 2, 6, 0 } }, //enet1_rxen
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_11, 1, 2, 1, 1, 0, 2, 6, 0 } }, //enet1_rxer
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_07, 1, 2, 1, 1, 0, 2, 6, 0 } }, //enet1_tx0
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_08, 1, 2, 1, 1, 0, 2, 6, 0 } }, //enet1_tx1
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_09, 1, 2, 1, 1, 0, 2, 6, 0 } }, //enet1_txen
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_10, 1, 2, 1, 1, 0, 2, 6, 0 } }, //enet1_txclk
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_12, 1, 2, 1, 1, 0, 2, 6, 0 } }, //enet_1588_event0_in
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_13, 1, 2, 1, 1, 0, 2, 6, 0 } }, //enet_1588_event0_out

		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_04, 1, 3 } }, //enet1_rx0
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_05, 1, 3 } }, //enet1_rx1
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_06, 1, 3 } }, //enet1_rxen
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_11, 1, 3 } }, //enet1_rxer
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_07, 1, 3 } }, //enet1_tx0
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_08, 1, 3 } }, //enet1_tx1
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_09, 1, 3 } }, //enet1_txen
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_10, 1, 6 } }, //enet_ref_clk
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_12, 1, 3 } }, //enet_1588_event0_in
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_13, 1, 3 } }, //enet_1588_event0_out
		// SION(1) = enable clk loopback to ENET module?
		// (RX does not work without it)
	};
	static const platformctl_t pctl_enet2[] = {
		{ pctl_set, pctl_iogpr, .iogpr = { pctl_gpr_enet2_clk_sel, 0 } },
		{ pctl_set, pctl_iogpr, .iogpr = { pctl_gpr_enet2_tx_clk_dir, 1 } },
		{ pctl_set, pctl_ioisel, .ioisel = { pctl_isel_enet2_ipg_clk_rmii, 2 } },

		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_01, 1, 2, 1, 1, 0, 2, 6, 0 } }, //pctl_pad_enet2_rx
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_02, 1, 2, 1, 1, 0, 2, 6, 0 } }, //pctl_pad_enet2_rx1
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_03, 1, 2, 1, 1, 0, 2, 6, 0 } }, //pctl_pad_enet2_rxen
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_00, 1, 2, 1, 1, 0, 2, 6, 0 } }, //pctl_pad_enet2_rxer
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_14, 1, 2, 1, 1, 0, 2, 6, 0 } }, //pctl_pad_enet2_tx0
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b1_15, 1, 2, 1, 1, 0, 2, 6, 0 } }, //pctl_pad_enet2_tx1
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b0_14, 1, 2, 1, 1, 0, 2, 6, 0 } }, //pctl_pad_enet2_txen
		{ pctl_set, pctl_iopad, .iopad = { pctl_pad_gpio_b0_15, 1, 0, 0, 0, 0, 0, 6, 1 } }, //pctl_pad_enet2_txclk

		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_01, 1, 8 } }, //pctl_mux_enet2_rx0
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_02, 1, 8 } }, //pctl_mux_enet2_rx1
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_03, 1, 8 } }, //pctl_mux_enet2_rxen
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_00, 1, 8 } }, //pctl_mux_enet2_rxer
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_14, 1, 8 } }, //pctl_mux_enet2_tx0
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b1_15, 1, 8 } }, //pctl_mux_enet2_tx1
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b0_14, 1, 8 } }, //pctl_mux_enet2_txen
		{ pctl_set, pctl_iomux, .iomux = { pctl_mux_gpio_b0_15, 1, 8 } }, //pctl_mux_enet2_txclk
	};

	int err;

	if (state->devphys == 0x402D8000 /* imxrt1064.ENET1 */) {
#ifdef ENET_VERBOSE
		enet_printf(state, "configure ENET1 pins");
#endif
		err = platformctl_seq(pctl_enet1, sizeof(pctl_enet1) / sizeof(*pctl_enet1));
	}
	else if (state->devphys == 0x402D4000 /* imxrt1064.ENET2 */) {
#ifdef ENET_VERBOSE
		enet_printf(state, "configure ENET2 pins");
#endif
		err = platformctl_seq(pctl_enet2, sizeof(pctl_enet2) / sizeof(*pctl_enet2));
	}
	else {
		err = 0;
	}

	if (err < 0) {
		enet_printf(state, "Can't configure ENET pins");
		return err;
	}

