phoenix-rtos/phoenix-rtos-lwip/drivers/imxrt-enet.c
	state->mmio->RCR =
#if USE_RMII
		ENET_RCR_RMII_MODE |
#endif
		ENET_RCR_MII_MODE;

	return 0;
}


static int enet_initDevice(enet_priv_t *state, int irq, int mdio)
{
	// FIXME: cleanup on error
	int err;

	usleep(1000000);

	snprintf(state->name, sizeof(state->name), "enet@%08x", state->devphys);

	state->mmio = physmmap(state->devphys, 0x1000);
	if (state->mmio == (void *)-1)
		return -ENODEV;

	if ((err = create_mutexcond_bulk(PRIV_RESOURCES(state))))
		return err;

	if ((err = enet_clockEnable(state)) < 0)
		return err;

	enet_reset(state);
	enet_readCardMac(state);
	enet_pinConfig(state);

	if (mdio) {
		err = enet_initMDIO(state);
		if (err < 0)
			return err;
	}

	if ((err = enet_initRings(state)))
		return err;

#ifdef ENET_VERBOSE
	enet_printf(state, "mmio 0x%x irq %d", state->devphys, irq);
#endif



	*((uint32_t*)0x400d80e4) =  1 | (1 << 2) | (1 << 13) | (1 << 20) | (1 << 21); //set enet1,enet2 for 25MHz, enable PLL
	*((uint32_t*)0x400d80e8) = (1 << 12);

	*((uint32_t*)0x400AC004) |= (1 << 23); //set ENET_IPG_CLK_S_EN in (IOMUXC_GPR_GPR1)

	*((uint32_t*)0x401F8448) |= 1; //tx_clk daisy chain alt3

#ifdef ENET_VERBOSE
	printf("\tPLL_ENET: %08x\n", *((uint32_t*)0x400d80e0));
	printf("\tCCGR1: %08x\n", *((uint32_t*)0x400FC06C));
	printf("\tGPR1: %08x\n", *((uint32_t*)0x400AC004));
#endif


	interrupt(irq, enet_irq_handler, state, state->irq_cond, &state->irq_handle);
	beginthread(enet_irq_thread, 4, state->irq_stack, sizeof(state->irq_stack), state);

	if (state->mscr) {
		err = register_mdio_bus(&enet_mdio_ops, state);
		if (err < 0) {
			enet_printf(state, "Can't register MDIO bus");
			return err;
		}

		enet_printf(state, "MDIO bus %d", err);
	}

	net_refillRx(&state->rx, 2);
	enet_start(state);

	enet_showCardId(state);

	return 0;
}


static err_t enet_netifOutput(struct netif *netif, struct pbuf *p)
{
	enet_priv_t *state = netif->state;
	size_t nf;

	if (ETH_PAD_SIZE != 2)
		pbuf_header(p, -ETH_PAD_SIZE); /* drop the padding word */

	mutexLock(state->tx_lock);
	nf = net_transmitPacket(&state->tx, p);
	if (nf)
		state->mmio->TDAR = ~0u;
	mutexUnlock(state->tx_lock);

	return nf ? ERR_OK : ERR_BUF;
}

static void enet_setLinkState(void *arg, int state)
{
	struct netif* netif = (struct netif*) arg;
	enet_priv_t *priv = netif->state;
	int speed, full_duplex;

	if (state) {
		speed = ephy_link_speed(&priv->phy, &full_duplex);

		if (speed == 10) {
			priv->mmio->RCR |= ENET_RCR_RMII_10T;
		}
		else if (speed == 100) {
			priv->mmio->RCR &= ~ENET_RCR_RMII_10T;
		}

		netif_set_link_up(netif);
	}
	else {
		netif_set_link_down(netif);
	}
}

// ARGS: enet:base:irq[:no-mdio][:PHY:[bus.]addr[:config]]
static int enet_netifInit(struct netif *netif, char *cfg)
{
	enet_priv_t *priv;
	char *p;
	int err, irq, mdio = 1;

	netif->linkoutput = enet_netifOutput;

	priv = netif->state;
	priv->netif = netif;

	if (!cfg)
		return -EINVAL;

	priv->devphys = strtoul(cfg, &p, 0);
	if (!*cfg || *p++ != ':')
		return -EINVAL;

	irq = strtoul((cfg = p), &p, 0);
	if (!*cfg || (*p && *p++ != ':') || irq < 0)
		return -EINVAL;

	cfg = NULL;
	while (p && *p) {
		cfg = strchr(p, ':');
		if (cfg)
			*cfg++ = 0;

		if (!strcmp(p, "no-mdio")) {
			mdio = 0;
			p = cfg;
			continue;
		}

		if (!strcmp(p, "PHY"))
			break;

		return -EINVAL;
	}

	if ((err = enet_initDevice(priv, irq, mdio)))
		return err;

	if (cfg) {
		err = ephy_init(&priv->phy, cfg, enet_setLinkState, (void*) priv->netif);
		if (err)
			enet_printf(priv, "WARN: PHY init failed: %s (%d)", strerror(err), err);
	}

	return 0;
}


const char *enet_media(struct netif *netif)
{
	int full_duplex, speed;
	enet_priv_t *priv;
	priv = netif->state;

	speed = ephy_link_speed(&priv->phy, &full_duplex);

	switch (speed) {
	case 0:
		return "unspecified";
		break;
	case 10:
		if (full_duplex)
			return "10Mbps/full-duplex";
		else
			return "10Mbps/half-duplex";
		break;
	case 100:
		if (full_duplex)
			return "100Mbps/full-duplex";
		else
			return "100Mbps/half-duplex";
		break;
	case 1000:
		if (full_duplex)
			return "1000Mbps/full-duplex";
		else
			return "1000Mbps/half-duplex";
		break;
	default:
		return "unrecognized";
	}
}


static netif_driver_t enet_drv = {
	.init = enet_netifInit,
	.state_sz = sizeof(enet_priv_t),
	.state_align = _Alignof(enet_priv_t),
	.name = "enet",
	.media = enet_media,
};


__constructor__(1000)
void register_driver_enet(void)
{
	register_netif_driver(&enet_drv);
}
